<!-- MoreInfo.svelte -->
<script>
    import { onMount } from 'svelte';

    let isVisible = false;

    onMount(() => {
        // Устанавливаем isVisible в true после загрузки страницы
        isVisible = true;
    });
</script>

<h1>Дополнительная информация</h1>

<p class={isVisible ? 'fade-in' : ''}>
    Добро пожаловать на страницу "Дополнительная информация"! В нашем магазине мы предлагаем широкий выбор игровых товаров:
</p>

<ul class={isVisible ? 'fade-in' : ''}>
    <li>Компьютерные игры для всех возрастов и платформ;</li>
    <li>Аксессуары для геймеров: геймпады, наушники, клавиатуры и многое другое;</li>
    <li>Игровые подписки и карточки оплаты для различных онлайн-платформ;</li>
    <li>Игровые консоли нового поколения и классические ретро-консоли.</li>
</ul>

<p class={isVisible ? 'fade-in' : ''}>
    Мы постоянно обновляем наш ассортимент, следим за новинками индустрии и стараемся удовлетворить потребности каждого клиента. Наши товары подходят как для профессиональных геймеров, так и для тех, кто только начинает свой путь в мире видеоигр.
</p>

<p class={isVisible ? 'fade-in' : ''}>
    Не упустите возможность приобрести игры и аксессуары по выгодным ценам! Для получения дополнительной информации свяжитесь с нами по телефону или по электронной почте.
</p>

<style>
    .fade-in {
        opacity: 0;
        transition: opacity 1s ease-in-out;
    }


</style>









